EasyNotes-BackEnd/app/controllers/api/v4/collection_notes_controller.rb

INSERT INTO "notes" ("title", "content", "user_id", "is_shared", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", ""], ["content", ""], ["user_id", "5"], ["is_shared", 0], ["created_at", "2024-05-08 12:06:29.000368"], ["updated_at", "2024-05-08 12:06:29.000368"]]
INSERT INTO "collection_notes" ("id_collection", "id_note", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["id_collection", 1], ["id_note", 1], ["created_at", "2024-04-16 19:33:50.663831"], ["updated_at", "2024-04-16 19:33:50.663831"]]
---
  def create
    collection_note_params = params.require(:collection_note).permit(:id_collection, :id_note)
    collection_note = CollectionNote.new(collection_note_params)
    if collection_note.save

SELECT "collection_notes".* FROM "collection_notes" WHERE "collection_notes"."id_collection" = ?  [["id_collection", 2]]
---
  def getByCollectionId
    collection_notes = CollectionNote.where(id_collection:params[:id_collection])