EasyNotes-BackEnd/app/controllers/api/v1/notes_controller.rb

  def index
    notes = Note.all()
---
SELECT "notes".* FROM "notes"

  def show
    note = Note.find_by(id:params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def getLast
    note = Note.last()
---
SELECT "notes".* FROM "notes" ORDER BY "notes"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def showByUser
    notes = Note.where(user_id:params[:user_id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ?  [["user_id", "undefined"]]

  def create
    note_params = params.require(:note).permit(:title, :content, :user_id, :is_shared)
    note = Note.new(note_params)
    if note.save
---
INSERT INTO "notes" ("title", "content", "user_id", "is_shared", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "hola"], ["content", "hola"], ["user_id", "2"], ["is_shared", 0], ["created_at", "2024-04-16 19:33:50.575274"], ["updated_at", "2024-04-16 19:33:50.575274"]]

  def update
    note = Note.find_by(id: params[:id])
    if note
      note.update(title: params[:title], content: params[:content], user_id: params[:user_id], is_shared: params[:is_shared])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "notes" SET "is_shared" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["is_shared", 1], ["updated_at", "2024-05-09 15:35:30.783943"], ["id", 21]]

  def destroy
    note = Note.find(params[:id])
    if note
      note.destroy
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 8]]