EasyNotes-BackEnd/app/controllers/api/v2/users_controller.rb

  def index
    users = User.all()
---
SELECT "users".* FROM "users"

  def create
    user_params = params.require(:user).permit(:name, :surname, :admin, :is_enabled, :hash)
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("name", "surname", "admin", "is_enabled", "hash", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "utri"], ["surname", "Utri"], ["admin", 0], ["is_enabled", 1], ["hash", "dXRyaQ=="], ["created_at", "2024-04-16 19:35:24.128284"], ["updated_at", "2024-04-16 19:35:24.128284"]]

  def update
    user = User.find_by(id: params[:id])
    if user
      user.update(name: params[:name], surname: params[:surname], admin: params[:admin], is_enabled: params[:is_enabled],hash: params[:hash])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["admin", 1], ["updated_at", "2024-05-08 18:36:13.406606"], ["id", 5]]

  def destroy
    user = User.find(params[:id])
    if user
      user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]