EasyNotes-BackEnd/app/controllers/api/v3/collections_controller.rb

  def index
    collections = Collection.all()
---
SELECT "collections".* FROM "collections"

  def show
    collection = Collection.find_by(id:params[:id])
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    collection_params = params.require(:collection).permit(:description, :id_user)
    collection = Collection.new(collection_params)
    if collection.save
---
INSERT INTO "collections" ("description", "id_user", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "prueba"], ["id_user", 2], ["created_at", "2024-04-16 19:33:39.955870"], ["updated_at", "2024-04-16 19:33:39.955870"]]

  def showByUser
    collections = Collection.where(id_user:params[:id_user])
---
SELECT "collections".* FROM "collections" WHERE "collections"."id_user" = ?  [["id_user", nil]]

  def destroy
    collection = Collection.find(params[:id])
    if collection
      collection.destroy
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "collections" WHERE "collections"."id" = ?  [["id", 5]]