EasyNotes-BackEnd/app/controllers/api/v5/friendships_controller.rb

  def index
    friendships = Friendship.all()
---
SELECT "friendships".* FROM "friendships"

  def Allowance
    friendship = Friendship.find_by(id: params[:id])
    if friendship
      friendship.update(allowed: 1)
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "friendships" SET "allowed" = ?, "updated_at" = ? WHERE "friendships"."id" = ?  [["allowed", 1], ["updated_at", "2024-05-10 10:25:53.455310"], ["id", 16]]

  def destroy
    friendship = Friendship.find_by(params[:id])
    if friendship
      friendship.destroy
---
SELECT "friendships".* FROM "friendships" WHERE (1) LIMIT ?  [["LIMIT", 1]]
DELETE FROM "friendships" WHERE "friendships"."id" = ?  [["id", 1]]

  def create
    friendship_params = params.require(:friendship).permit(:name_user1,:name_user2,:id_user1, :id_user2,:allowed)
    friendship = Friendship.new(friendship_params)
    if friendship.save
---
INSERT INTO "friendships" ("name_user1", "name_user2", "id_user1", "id_user2", "allowed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name_user1", "Olga"], ["name_user2", "Isaaki"], ["id_user1", 5], ["id_user2", 0], ["allowed", 0], ["created_at", "2024-05-07 10:56:05.952445"], ["updated_at", "2024-05-07 10:56:05.952445"]]

  def showById
    friendship = Friendship.find_by(id_user2:params[:id_user2])
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."id_user2" = ? LIMIT ?  [["id_user2", 6], ["LIMIT", 1]]